---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleMatrix44
source: html/cce4c164-b055-6fbc-289d-fd2fcb9b7500.htm
---
# AssetPropertyDoubleMatrix44 Methods

Adds a new connected asset attached to this asset property, if it allows it.